spec/vcr/Afterpay_Payment/_get_payment_by_order_id/fetches_a_payment_object_by_its_order_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.us-sandbox.afterpay.com/v2/payments/100101529842
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic <AUTH TOKEN>
      User-Agent:
      - Faraday v0.17.4
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Wed, 02 Jun 2021 11:16:20 GMT
      content-type:
      - application/json
      content-length:
      - '772'
      connection:
      - close
      cache-control:
      - private, no-cache, no-store, no-transform, must-revalidate, max-age=0
      http_correlation_id:
      - a3bhxmkh5acinuidwxkc3j45wq
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '30'
      cf-cache-status:
      - DYNAMIC
      cf-request-id:
      - 0a6e095dfe00000f2c9b2b0000000001
      expect-ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      set-cookie:
      - __cf_bm=f8e9cab1c78cda7bd6c36eedc92c5434ad3edb92-1622632580-1800-AaulQIrlUVRZulGajkOOYV5fc4eRe5+a/fwXlD19N5YimKZtnLnI77ycvOuUYKTQFMPNyVvTsgbnr5lob8+KTckgLOOskIrcddq5TjpEf9X9;
        path=/; expires=Wed, 02-Jun-21 11:46:20 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      server:
      - cloudflare
      cf-ray:
      - 659044dcc8c30f2c-BOM
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "id" : "100101529842",
          "token" : "002.avpv776th25fof4itbfvrc019dqje4ia27qjk5525o3mfosr",
          "status" : "APPROVED",
          "created" : "2021-06-01T10:49:10.774Z",
          "originalAmount" : {
            "amount" : "1000.00",
            "currency" : "USD"
          },
          "openToCaptureAmount" : {
            "amount" : "500.00",
            "currency" : "USD"
          },
          "paymentState" : "PARTIALLY_CAPTURED",
          "merchantReference" : "100101468",
          "refunds" : [ {
            "requestId" : "some_uniqe_val",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "refundId" : "1719864",
            "refundedAt" : "2021-06-01T10:58:42.465Z"
          } ],
          "orderDetails" : {
            "consumer" : {
              "phoneNumber" : "",
              "givenNames" : "",
              "surname" : "",
              "email" : "sachin@yourmechanic.com"
            },
            "billing" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "shipping" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "courier" : {
              "shippedAt" : "2021-06-02T11:00:43.000Z",
              "name" : "Bludart",
              "tracking" : "AWB129181",
              "priority" : "EXPRESS"
            },
            "items" : [ ],
            "discounts" : [ ],
            "shippingAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "taxAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            }
          },
          "events" : [ {
            "id" : "1tLOnWb3zejkNWCtkfNBoCXiCus",
            "created" : "2021-06-01T10:57:49.981Z",
            "expires" : "2021-06-08T10:57:49.980Z",
            "type" : "AUTH_APPROVED",
            "amount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          }, {
            "id" : "1tLOu14Ajgoyoh8lBLhoEuYDgAr",
            "created" : "2021-06-01T10:58:41.543Z",
            "expires" : null,
            "type" : "CAPTURED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : ""
          }, {
            "id" : "1tLOuCKI3ee5yjWcvfI50uRjqea",
            "created" : "2021-06-01T10:58:42.495Z",
            "expires" : null,
            "type" : "VOIDED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          } ]
        }
    http_version: 
  recorded_at: Wed, 02 Jun 2021 11:16:20 GMT
recorded_with: VCR 4.0.0
