spec/vcr/Afterpay_Payment/_update_payment_by_order_id/returns_an_object_with_updated_merchantReference.yml

---
http_interactions:
- request:
    method: put
    uri: https://api.us-sandbox.afterpay.com/v2/payments/100101529842
    body:
      encoding: UTF-8
      string: '{"merchantReference":"new_merchant_order_id_1234"}'
    headers:
      Authorization:
      - Basic <AUTH TOKEN>
      User-Agent:
      - Faraday v0.17.4
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Thu, 03 Jun 2021 09:19:53 GMT
      content-type:
      - application/json
      transfer-encoding:
      - chunked
      connection:
      - close
      http_correlation_id:
      - yusrv57i7ir6kzv2dq6rk43rsq
      x-envoy-upstream-service-time:
      - '60'
      cf-cache-status:
      - DYNAMIC
      cf-request-id:
      - 0a72c519f100002e1d591f7000000001
      expect-ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      set-cookie:
      - __cf_bm=bd3b25167d79aa2d51ea7ad9e34aa56e0c023be7-1622711993-1800-AViA8adRCIhqyTfavfP/SBF8BYLNS5pvLEzEBZWs2T9GKsBqnYFyXxe1/CvkBRAKYjxNQkgz/0/Lv92iWCc7aIpFXR4wcA76AsROgHCgG7Ts;
        path=/; expires=Thu, 03-Jun-21 09:49:53 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      server:
      - cloudflare
      cf-ray:
      - 6597d7a319ff2e1d-BOM
    body:
      encoding: ASCII-8BIT
      string: |-
        {
          "id" : "100101529842",
          "token" : "002.avpv776th25fof4itbfvrc019dqje4ia27qjk5525o3mfosr",
          "status" : "APPROVED",
          "created" : "2021-06-01T10:49:10.774Z",
          "originalAmount" : {
            "amount" : "1000.00",
            "currency" : "USD"
          },
          "openToCaptureAmount" : {
            "amount" : "500.00",
            "currency" : "USD"
          },
          "paymentState" : "PARTIALLY_CAPTURED",
          "merchantReference" : "new_merchant_order_id_1234",
          "refunds" : [ {
            "requestId" : "some_uniqe_val",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "refundId" : "1719864",
            "refundedAt" : "2021-06-01T10:58:42.465Z"
          } ],
          "orderDetails" : {
            "consumer" : {
              "phoneNumber" : "",
              "givenNames" : "",
              "surname" : "",
              "email" : "sachin@yourmechanic.com"
            },
            "billing" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "shipping" : {
              "name" : "ADDESS1",
              "line1" : "SOME",
              "line2" : "value",
              "region" : "U.S. state.",
              "postcode" : "000000",
              "countryCode" : "US",
              "phoneNumber" : "5555555"
            },
            "courier" : {
              "shippedAt" : "2021-06-02T11:00:43.000Z",
              "name" : "Bludart",
              "tracking" : "AWB129181",
              "priority" : "EXPRESS"
            },
            "items" : [ ],
            "discounts" : [ ],
            "shippingAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "taxAmount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            }
          },
          "events" : [ {
            "id" : "1tLOnWb3zejkNWCtkfNBoCXiCus",
            "created" : "2021-06-01T10:57:49.981Z",
            "expires" : "2021-06-08T10:57:49.980Z",
            "type" : "AUTH_APPROVED",
            "amount" : {
              "amount" : "1000.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          }, {
            "id" : "1tLOu14Ajgoyoh8lBLhoEuYDgAr",
            "created" : "2021-06-01T10:58:41.543Z",
            "expires" : null,
            "type" : "CAPTURED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : ""
          }, {
            "id" : "1tLOuCKI3ee5yjWcvfI50uRjqea",
            "created" : "2021-06-01T10:58:42.495Z",
            "expires" : null,
            "type" : "VOIDED",
            "amount" : {
              "amount" : "250.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          } ]
        }
    http_version: 
  recorded_at: Thu, 03 Jun 2021 09:19:53 GMT
recorded_with: VCR 4.0.0
